chtMultiregion/burner_C2H4/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    f_front
    {
        type            wedge;
        physicalType    wedge;
        inGroups        List<word> 1(wedge);
        nFaces          15802;
        startFace       31322;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          92;
        startFace       47124;
    }
    f_back
    {
        type            wedge;
        physicalType    wedge;
        inGroups        List<word> 1(wedge);
        nFaces          15802;
        startFace       47216;
    }
    fuel
    {
        type            patch;
        physicalType    patch;
        nFaces          74;
        startFace       63018;
    }
    burner
    {
        type            patch;
        physicalType    patch;
        nFaces          66;
        startFace       63092;
    }
    shield
    {
        type            patch;
        physicalType    patch;
        nFaces          18;
        startFace       63158;
    }
    fluid_to_solid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          158;
        startFace       63176;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_fluid;
    }
)

// ************************************************************************* //
