chtMultiregion/burner_C2H4/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    s_front
    {
        type            wedge;
        physicalType    wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1975;
        startFace       3824;
    }
    s_back
    {
        type            wedge;
        physicalType    wedge;
        inGroups        List<word> 1(wedge);
        nFaces          1975;
        startFace       5799;
    }
    defaultFaces
    {
        type            patch;
        nFaces          4;
        startFace       7774;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          158;
        startFace       7778;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
