chtMultiregion/burner_C2H4/constant/fluid/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          EulerImplicit;
}

chemistry       on;

initialChemicalTimeStep 1e-08;

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-3;

}

EulerImplicitCoeffs
{
    cTauChem        1;
}

#include "reactions"

// ************************************************************************* //
