chtMultiregion/burner_C2H4/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    fuel
    {
        type            fixedFluxExtrapolatedPressure;
    }

    shield
    {
        type            fixedFluxExtrapolatedPressure;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000; // FIXME
    }

    burner
    {
        type            fixedFluxExtrapolatedPressure;
    }

    f_front
    {
        type            wedge;
    }

    f_back
    {
        type            wedge;
    }

    fluid_to_solid
    {
        type            fixedFluxExtrapolatedPressure;
    }
}


// ************************************************************************* //
