chtMultiregion/burner_C2H4/0.orig/fluid/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet
    {
        type            zeroGradient;
    }

    shield
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    burner
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    f_front
    {
        type            wedge;
    }

    f_back
    {
        type            wedge;
    }
}


// ************************************************************************* //
