chtMultiregion/burner_C2H4/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 0;
    grad(U)         cellMDLimited Gauss linear 0.333;
}
  
divSchemes
{
    default         none;
 
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,h)      Gauss linearUpwind default;
    div(phi,Yi_h)   Gauss limitedLinear 1;
    div(phi,k)      Gauss linearUpwind default;
    div(phi,epsilon) Gauss linearUpwind default;
    div(phi,K)      Gauss linear;
    div(phiv,p)     Gauss linear 0.333;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
  
laplacianSchemes
{
    default        Gauss linear limited 1.0;
}
  
interpolationSchemes
{
    default         linear;
}
  
snGradSchemes
{
    default         limited 1.0;
}

// ************************************************************************* //
