chtMultiregion/burner_C2H4/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
        box (0.0 0.1 -1.0) (0.030226 0.102 1.0);
        fieldValues
        (
            volScalarFieldValue C2H4 0.03
            volScalarFieldValue T 1000
        );
    }

    boxToCell
    {
        box (0.0 0.102 -1.0) (0.030226 0.11 1.0);
        fieldValues
        (
            volScalarFieldValue T 1813.7916714776784
            volScalarFieldValue C2H4 0.001
        );
    }

    boxToCell
    {
        box (0.030226 0.10 -1.0) (0.036703 0.11 1.0);
        fieldValues
        (
            volScalarFieldValue T 300
        );
    }
);

// ************************************************************************* //
